Revit 2027 API
PanelTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PanelTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As PanelTypeSetIterator
public:
virtual PanelTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PanelTypeSetIterator
override ForwardIterator : unit -> PanelTypeSetIterator
Return Value
PanelTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
PanelTypeSet Class
Autodesk.Revit.DB Namespace